[
  {
    "id": 1,
    "text": "I have dealt with various recruitment portals but the kind of services Coursemonster&nbsp;offers are outstanding. The portal is very user friendly and quick in responding to the user’s requirements.",
    "name": "JOHNNY SANDERS",
    "designation": "Branding Manager",
    "image": "https://usercontent.one/wp/wakeel360.org/wp-content/uploads/2015/02/candidate_03-100x100.jpg"
  },
  {
    "id": 2,
    "text": "Coursemonster is a great platform for talent sourcing, a wide range of profiles from all specialties is available, and the site is very much user friendly. The team is very helpful!",
    "name": "JOHNNY SANDERS",
    "designation": "Branding Manage",
    "image": "https://usercontent.one/wp/wakeel360.org/wp-content/uploads/2015/02/candidate_01-100x100.jpg"
  },
  {
    "id": 3,
    "text": "My experience with Coursemonster has been incredible. They have a comprehensive database with a varied range of profiles spanning nationalities and professions.",
    "name": "JOHNNY SANDERS",
    "designation": "Branding Manage",
    "image": "https://usercontent.one/wp/wakeel360.org/wp-content/uploads/2015/02/candidate_06-100x100.jpg"
  },
  {
    "id": 4,
    "text": "We started using Coursemonster&nbsp;few years ago, during our experience we found it an excellent portal where a huge pool of qualified CVS are placed, easy to search, find, communicate and approach candidates.",
    "name": "JOHNNY SANDERS",
    "designation": "Branding Manage",
    "image": "https://usercontent.one/wp/wakeel360.org/wp-content/uploads/2015/01/user3-100x100.jpg"
  },
  {
    "id": 5,
    "text": "Personal assistance with great efforts from the staff is always provided, Coursemonster&nbsp;indeed participated in facilitating the recruitment process in terms of timing, efficiency and cost reduction, and we do believe, we shall keep using it for long.",
    "name": "JOHNNY SANDERS",
    "designation": "Branding Manage",
    "image": "https://usercontent.one/wp/wakeel360.org/wp-content/uploads/2015/01/user2-100x100.jpg"
  },
  {
    "id": 6,
    "text": "I’d like to add that Coursemonster&nbsp;is very user-friendly in terms of searching resumes. There is no doubt, if you wish to attain your business goals by hiring expert resources, then Coursemonster&nbsp;is ‘THE’ partner to start with!",
    "name": "JOHNNY SANDERS",
    "designation": "Branding Manage",
    "image": "https://usercontent.one/wp/wakeel360.org/wp-content/uploads/2015/01/user1-100x100.jpg"
  }
]
